init.org
#+TITLE: init
#+STARTUP: overview
* init-header
** 说明
*** 文件结构
;;; package --- init file
;;; Commentary:
;;; Code:

...这里填写配置内容...
配置文件的结尾需要添加 (provide 'commons-cfg) 来自动加载

;;; init.el ends here
*** 使用 文件加载方式管理 emacs 配置文件
;;;; ------------------------------------
;;;; 初始化
;;;; ------------------------------------

;; 添加路径 require 文件
(add-to-list 'load-path (expand-file-name (concat user-emacs-directory "etc")))

;; 当用户手动从Emacs中修改设置，系统自动生成的文件放到下面目录
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

;; 当有系统自动生成文件时，加载它
(when (file-exists-p custom-file) (load-file custom-file))

;; 不进行签名检查
;;(setq package-check-signature nil)

;;;; ------------------------------------
;;;; 加载各种单独的配置文件
;;;; ------------------------------------

(require 'me-package)              ;; 加载自定义函数变量包
(require 'melpa-cfg)               ;; 配置软件源安装包管理工具 use-package
(require 'packages-install-cfg)    ;; 安装软件包并且配置
(require 'programs-install-cfg)    ;; 安装编程语言相关包
;;(require 'pyim-install-cfg)      ;; 安装 Emacs 内置输入法
(require 'coding-systems-cfg)      ;; 配置编码格式
(require 'fonts-cfg)               ;; 配置字体
(require 'commons-cfg)             ;; 界面设定等通用配置
(require 'others-cfg)              ;; 内置包系统差异等配置
(require 'key-bindings-cfg)        ;; 自定义快捷键绑定
;;(require 'lsp-racket)            ;; 参考使用 lsp 不支持 racket
*** 使用 org-mode 文学编程管理 emacs 配置文件
;; 第一种方式
(org-babel-load-file (expand-file-name "~/.emacs.d/myinit.org"))

;; 第二种方式
;; (require 'org)
(org-babel-load-file
    (expand-file-name "settings.org" user-emacs-directory))
** 配置
#+begin_src emacs-lisp
  ;;; init.el --- Load the full configuration -*- lexical-binding: t -*-
  ;;; Commentary:
  ;;; Code:

#+end_src
* initialization
** 说明
添加文件路径 require 文件时告诉 emacs 目标路径
(add-to-list 'load-path (expand-file-name (concat user-emacs-directory "etc")))

当用户手动从 Emacs 中修改设置时系统自动生成的配置放到下面路径
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

当有系统自动生成配置的文件时，加载它
(when (file-exists-p custom-file) (load-file custom-file))

不进行签名检查
(setq package-check-signature nil)
** 配置
#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file) (load-file custom-file))
#+end_src
* init-custom-variable
** 说明
判断操作系统类型
*is-mac*
*is-linux*
*is-windows*
** 配置
#+begin_src emacs-lisp
  (defconst *is-mac* (eq system-type 'darwin))
  (defconst *is-linux* (eq system-type 'gnu/linux))
  (defconst *is-windows*
    (or (eq system-type 'ms-dos)
        (eq system-type 'windows-nt)))
#+end_src
* init-custom-function
** 说明
*** 手动切换中文和日文输入法
  (defun zero-cycle-input-method()
    "Cycle input in emacs"
    (interactive)
    (or (boundp 'zero-input-list)
        (setq zero-input-list '("japanese-katakana" "chinese-py" "japanese")
              zero-current-input zero-input-list))
    (if (null (cdr zero-current-input))
        (setq zero-current-input zero-input-list)
      (setq zero-current-input (cdr zero-current-input)))
    (set-input-method (car zero-current-input)))
*** 复制当前行或选中的区域
  (defun zero-copy-line-or-region()
    (interactive)
    (if mark-active
        (kill-ring-save (region-beginning)
                        (region-end))
      (progn
        (kill-ring-save (line-beginning-position)
                        (line-end-position))
        (message "copied line"))))
*** 常用函数
(line-beginning-position)  (line-end-position))
(move-beginning-of-line 1) (set-mark-command nil)
(move-end-of-line 1)
(kill-ring-save (region-beginning) (region-end))
** 配置
- 刷新配置文件
#+begin_src emacs-lisp
  (defun zero-config-setup-org()
    (interactive)
    (org-babel-load-file
     (expand-file-name "init.org" user-emacs-directory)))
#+end_src
- 打开 init.el
#+begin_src emacs-lisp
  (defun zero-open-init-file()
    (interactive)
    (find-file user-init-file))
#+end_src
- 复制一行到当前行下面
#+begin_src emacs-lisp
  (defun zero-duplicate-line()
    (interactive)
    (let ((col (current-column)))
      (kill-ring-save (line-beginning-position) (line-end-position))
      (move-end-of-line 1)
      (newline)
      (yank)
      (move-to-column col)))
#+end_src
- 移动当前行到上面一行
#+begin_src emacs-lisp
  (defun zero-move-line-up()
    (interactive)
    (or (= (point-min) (line-beginning-position))
        (let ((col (current-column)))
          (transpose-lines 1)
          (previous-line 2)
          (move-to-column col))))
#+end_src
- 移动当前行到下面一行
#+begin_src emacs-lisp
  (defun zero-move-line-down()
    (interactive)
    (or (= (point-max) (+ (line-end-position) 1))
        (let ((col (current-column)))
          (next-line 1)
          (transpose-lines 1)
          (previous-line 1)
          (move-to-column col))))
#+end_src
- 移动当前单词向左
#+begin_src emacs-lisp
  (defun zero-move-word-left()
    (interactive)
    (transpose-words -1))
#+end_src
- 移动当前单词向右
#+begin_src emacs-lisp
  (defun zero-move-word-right()
    (interactive)
    (transpose-words 1))
#+end_src
- 手动切换不同字体
#+begin_src emacs-lisp
  (defun zero-cycle-font-method()
    "Cycle font in emacs"
    (interactive)
    (or (boundp 'zero-font-list)
        (setq zero-font-list '("SauceCodePro Nerd Font Mono 13" "Noto Sans Mono CJK SC Regular 13")
              zero-current-font zero-font-list))
    (if (null (cdr zero-current-font))
        (setq zero-current-font zero-font-list)
      (setq zero-current-font (cdr zero-current-font)))
    (set-frame-font (car zero-current-font))
    (message (car zero-current-font)))
#+end_src
* init-encoding
** 说明
这个如果设定了在windows下会出现莫名的乱码不认字体
(setq locale-coding-system 'utf-8)

windows下设定语言环境会出现字体混乱
(set-language-environment 'utf-8)

下面两个是设置剪切板的字符集
因为windows是utf-16-le所以设置后复制粘贴会出现乱码
(set-clipboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)

默认读取文件编码
(prefer-coding-system 'utf-8)

默认写入文件的编码格式
(set-buffer-file-coding-system 'utf-8)

新建文件编码
(set-default-coding-systems 'utf-8)

键盘输入
(set-keyboard-coding-system 'utf-8)

终端
(set-terminal-coding-system 'utf-8)

文件名
(set-file-name-coding-system 'utf-8)
** 配置
#+begin_src emacs-lisp
  (prefer-coding-system 'utf-8)
  (set-buffer-file-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-file-name-coding-system 'utf-8)
#+end_src
* init-fonts
** 说明
*** 字体名称
YaHei Consolas Hybrid        Source Han Sans HW SC VF
Monaco    Source Code Pro    微软雅黑Monaco
Microsoft YaHei Mono         Fira Code Regular
Inziu Roboto SC Bold         Inziu Iosevka Slab SC
Fira Code Regular 10         Source Han Sans
Sarasa Term Slab SC          文泉驿等宽正黑
Sarasa Mono Slab SC          Cascadia Code PL SemiBold
星汉等宽 CN
*** 现在正在使用的字体
Noto Sans Mono CJK SC Regular  -- 等宽等高中英文
Xiaolai Mono SC                -- 中文 26
SauceCodePro Nerd Font Mono    -- 英文 13
*** 设置字体和大小
(set-frame-font "Cascadia Code PL 13")
(set-frame-font "Fira Code Regular 13")
*** 单独设置英文字体
(set-face-attribute
    'default nil :font "SauceCodePro Nerd Font Mono 13")
*** 单独设置中文字体
(dolist (charset '(kana han symbol cjk-misc bopomofo))
    (set-fontset-font (frame-parameter nil 'font)
            charset
            (font-spec :family "Xiaolai Mono SC" :size 26)))
*** 设置不同字体比例
  (setq face-font-rescale-alist
        '(("Fira Code" . (/ 20 12.0))
          ("Inziu Iosevka SC" . 1.2)
          ("Source Han Sans" . 1.2)))
*** 选择性的设置
  (if *is-windows*
      (progn
        (set-face-attribute 'default nil :font "Source Code Pro 12")
        (dolist (charset '(kana han symbol cjk-misc bopomofo))
          (set-fontset-font (frame-parameter nil 'font)
                            charset (font-spec :family "Inziu Iosevka SC" :size 22))))
    (set-face-attribute 'default nil :font "Source Code Pro 12"))

  (set-face-attribute 'default nil :font
                      (format   "%s:pixelsize=%d" "Fira Code Regular" 20))
  (dolist (charset '(kana han cjk-misc bopomofo))
    (set-fontset-font (frame-parameter nil 'font) charset
                      (font-spec :family "Source Han Sans" :size 20)))
*** 设定行间距
如果设置为整数，行间距是像素个数，如果是浮点数将会被视作相对倍数。
(setq line-spacing 1.5)
or if you want to set it globaly
(setq-default line-spacing 0.3)
** 配置
#+begin_src emacs-lisp
  (set-face-attribute
   'default nil :font "SauceCodePro Nerd Font Mono 13")

  (dolist (charset '(kana han symbol cjk-misc bopomofo))
    (set-fontset-font (frame-parameter nil 'font)
                      charset
                      (font-spec :family "Xiaolai Mono SC" :size 26)))
#+end_src
* init-ui
** 说明
- 设置界面显示
  (menu-bar-mode 0)				;; 删除菜单栏
  (scroll-bar-mode 0)			;; 删除滚动条
  (tool-bar-mode 0)				;; 删除工具栏
  (size-indication-mode t)			;; 显示文件大小
  (show-paren-mode t)			;; 显示前面匹配的括号
  (electric-pair-mode t)			;; 让括号成对的出现(打左括号出现右括号)
  (toggle-truncate-lines t)                 ;; 关闭自动折行功能
- 设置功能
  (setq inhibit-startup-screen t)           ;; 关闭Emacs启动画面方法2
  (setq gnus-inhibit-startup-message t)     ;; 关闭gnus启动时的画面
  (setq initial-scratch-message "Fuck")     ;; 启动画面文字
  (setq frame-title-format "Fuck")          ;; 设置标题栏
  (mouse-avoidance-mode 'animate)           ;; 光标过来时鼠标自动离开
  (setq initial-buffer-choice "~")          ;; 设定打开emacs时的buffer是目录或是某个文件
  (setq confirm-kill-emacs 'y-or-n-p)       ;; 退出emacs时询问是否退出 'yes-or-no-p
  (setq auto-window-vscroll nil)            ;; 自动调整行高
  (setq ring-bell-function 'ignore)		;; 关闭错误提示音
  (setq auto-save-default nil)		;; 关闭自动保存文件
  (setq make-backup-files nil)		;; 关闭自动备份文件
  (setq inhibit-splash-screen t)		;; 关闭Emacs启动画面
  (delete-selection-mode t)			;; 打字时删除选中区域
  (global-hl-line-mode t)                   ;; 当前行高亮显示
  (global-auto-revert-mode t)		;; 外部修改文件后从新加载
  (setq default-directory "~/")             ;; 设置默认路径 minibuffer的
- 滚动设置
  (setq scroll-step 0)                      ;; 好像是回滚多少行 默认是0
  (setq scroll-margin 5)                    ;; 当光标上下差5行时 屏幕开始滚动
  (setq scroll-conservatively 100)          ;; 当光标在屏幕边缘时自动回滚到0中心-100不回滚
- 打开时画面大小
  (setq default-frame-alist '((width . 99) (height . 29)))
- 全屏打开Emacs
  (setq initial-frame-alist (quote ((fullscreen . maximized))))
- 减少垃圾回收次数 数值调到最大
  (setq gc-cons-threshold most-positive-fixnum)
- 显示相对行号 visual relative
  (setq display-line-numbers-type 'relative)
  (global-display-line-numbers-mode t)
- 显示绝对行号 不要与相对行号同时存在
  (global-linum-mode t)
- 界面颜色，以下设置必须放在load主题后才能很好的生效
  (setq-default cursor-type 'bar)		 ;;改变光标样式
  (set-cursor-color "#FF8C00")		 ;;设置光标颜色
  (set-cursor-color "#DC143C")
  (set-background-color "black")		 ;;屏幕黑色背景
  (set-foreground-color "white")		 ;;屏幕白色前景
  (set-face-background 'region "violet")	 ;;选中区域背景色
  (set-face-background 'region "#b7ba6b")	 ;;选中区域背景色
** 配置
#+begin_src emacs-lisp
  (menu-bar-mode 0)
  (scroll-bar-mode 0)
  (tool-bar-mode 0)
  (size-indication-mode t)
  (show-paren-mode t)
  (electric-pair-mode t)
  (toggle-truncate-lines t)

  (setq ring-bell-function 'ignore)
  (setq auto-save-default nil)
  (setq make-backup-files nil)
  (setq inhibit-splash-screen t)

  (delete-selection-mode t)
  (global-hl-line-mode t)
  (global-auto-revert-mode t)
  (setq default-directory "~/")

  (setq default-frame-alist '((width . 99) (height . 29)))

  (setq scroll-conservatively 100)
  (global-linum-mode t)

  (set-cursor-color "#DC143C")
#+end_src
* init-key-map
** 说明
取消原来默认的定义
定义自己的 keymap
将自己的keymap绑定到快捷键
facemenu-keymap 新版本好像没了这个快捷键
(define-key zero-keymap (kbd "o") 'facemenu-keymap)
** 配置
#+begin_src emacs-lisp
  (global-unset-key (kbd "M-SPC"))
  (define-prefix-command 'zero-keymap)
  (global-set-key (kbd "M-SPC") 'zero-keymap)
#+end_src
* init-source-mirror
** 说明
初始的 gnu 源 melpa emacs
("gnu" . "http://elpa.gnu.org/packages/")

清华大学镜像站点
("gnu"          . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
("melpa"        . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")
("melpa-stable" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa-stable/")
("org"          . "http://mirrors.tuna.tsinghua.edu.cn/elpa/org/")
("marmalade"    . "http://mirrors.tuna.tsinghua.edu.cn/elpa/marmalade/")

          gnu   一般是必备的，其它的 elpa 中的包会依赖 gnu 中的包
        melpa   滚动升级，收录了的包的数量最大
 melpa-stable   依据源码的 Tag （Git）升级，数量比 melpa 少，因为很多包作者根本不打 Tag
          org   仅仅为了 org-plus-contrib 这一个包，org 重度用户使用
    marmalade   似乎已经不维护了，个人不推荐
** 配置
#+begin_src emacs-lisp
  (setq package-archives
        '(("gnu" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
          ("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")
          ("melpa-stable" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa-stable/")))
#+end_src
* use-package
