init.el
;;; init.el --- Load the full configuration -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file) (load-file custom-file))

(defconst *is-mac* (eq system-type 'darwin))
(defconst *is-linux* (eq system-type 'gnu/linux))
(defconst *is-windows*
  (or (eq system-type 'ms-dos)
      (eq system-type 'windows-nt)))

(defun zero-config-setup-org()
  (interactive)
  (org-babel-load-file
   (expand-file-name "init.org" user-emacs-directory)))

(defun zero-open-init-file()
  (interactive)
  (find-file user-init-file))

(defun zero-duplicate-line()
  (interactive)
  (let ((col (current-column)))
    (kill-ring-save (line-beginning-position) (line-end-position))
    (move-end-of-line 1)
    (newline)
    (yank)
    (move-to-column col)))

(defun zero-move-line-up()
  (interactive)
  (or (= (point-min) (line-beginning-position))
      (let ((col (current-column)))
        (transpose-lines 1)
        (previous-line 2)
        (move-to-column col))))

(defun zero-move-line-down()
  (interactive)
  (or (= (point-max) (+ (line-end-position) 1))
      (let ((col (current-column)))
        (next-line 1)
        (transpose-lines 1)
        (previous-line 1)
        (move-to-column col))))

(defun zero-move-word-left()
  (interactive)
  (transpose-words -1))

(defun zero-move-word-right()
  (interactive)
  (transpose-words 1))

(defun zero-cycle-font-method()
  "Cycle font in emacs"
  (interactive)
  (or (boundp 'zero-font-list)
      (setq zero-font-list '("SauceCodePro Nerd Font Mono 13" "Noto Sans Mono CJK SC Regular 13")
            zero-current-font zero-font-list))
  (if (null (cdr zero-current-font))
      (setq zero-current-font zero-font-list)
    (setq zero-current-font (cdr zero-current-font)))
  (set-frame-font (car zero-current-font))
  (message (car zero-current-font)))

(prefer-coding-system 'utf-8)
(set-buffer-file-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-file-name-coding-system 'utf-8)

(set-face-attribute
 'default nil :font "SauceCodePro Nerd Font Mono 13")

(dolist (charset '(kana han symbol cjk-misc bopomofo))
  (set-fontset-font (frame-parameter nil 'font)
                    charset
                    (font-spec :family "Xiaolai Mono SC" :size 26)))

(menu-bar-mode 0)
(scroll-bar-mode 0)
(tool-bar-mode 0)
(size-indication-mode t)
(show-paren-mode t)
(electric-pair-mode t)
(toggle-truncate-lines t)

(setq ring-bell-function 'ignore)
(setq auto-save-default nil)
(setq make-backup-files nil)
(setq inhibit-splash-screen t)

(delete-selection-mode t)
(global-hl-line-mode t)
(global-auto-revert-mode t)
(setq default-directory "~/")

(setq default-frame-alist '((width . 99) (height . 29)))

(setq scroll-conservatively 100)
(global-linum-mode t)

(set-cursor-color "#DC143C")

(global-unset-key (kbd "M-SPC"))
(define-prefix-command 'zero-keymap)
(global-set-key (kbd "M-SPC") 'zero-keymap)

(setq package-archives
      '(("gnu" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
        ("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")
        ("melpa-stable" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa-stable/")))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(use-package monokai-theme
  :ensure t
  :defer t
  :init (load-theme 'monokai t))
