init.org
** 说明
含有自动加载(###,,,autoload)，不加载也能使用
(require 'package)

初始化包管理文件，貌似新版本也自动初始化
(unless (bound-and-true-p package-initialized)
    (package-initialize))

刷新软件源
(unless package-archive-contents (package-refresh-contents))

安装包管理工具 use-package
(unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

加载包管理工具 use-package
(require 'use-package)

配置包管理工具 use-package
(setq use-package-always-ensure t)
(setq use-package-always-pin "melpa-stable")
(setq use-package-always-defer t)
(setq use-package-always-demand t)
(setq use-package-expand-minimally t)
(setq use-package-verbose t)

使用说明
(use-package monokai-theme
    :ensure t
    :pin melpa-stable
    :defer t
    :init (load-theme 'monokai t)
    :after (ivy)
    :bind (("M-x" . counsel-M-x))
    :config)
** 配置
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
#+end_src
* install-configure-packages
** themes
- color-theme-sanityinc-tomorrow
(require 'color-theme-sanityinc-tomorrow)
M-x color-theme-sanityinc-tomorrow-day
M-x color-theme-sanityinc-tomorrow-night
M-x color-theme-sanityinc-tomorrow-blue
M-x color-theme-sanityinc-tomorrow-bright
M-x color-theme-sanityinc-tomorrow-eighties
(use-package color-theme-sanityinc-tomorrow
    :ensure t
    :defer t)
- other theme
monokai-theme 'monokai
spacemacs-theme 'spacemacs-dark
dracula-theme 'dracula
zenburn-theme 'zenburn
solarized-theme 'solarized-dark
material-theme 'material
#+begin_src emacs-lisp
  (use-package monokai-theme
    :ensure t
    :defer t
    :init (load-theme 'monokai t))
#+end_src
** which-key
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :defer t
    :init (which-key-mode))
#+end_src
** ivy
:config
(setq ivy-use-virtual-buffers t)
(setq ivy-initial-inputs-alist nil)
(setq enable-recursive-minibuffers t)
(setq ivy-re-builders-alist '((t . ivy--regex-ignore-order))))
#+begin_src emacs-lisp
  (use-package ivy
    :ensure t
    :defer t
    :init (ivy-mode)
    :config
    (setq ivy-count-format "(%d/%d) "))
#+end_src
** counsel
:bind
("C-c g" . counsel-git)
("C-c f" . counsel-recentf)
#+begin_src emacs-lisp
  (use-package counsel
    :ensure t
    :after (ivy)
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-switch-buffer)
           ("C-x C-b" . ibuffer)
           ("C-x C-f" . counsel-find-file)))
#+end_src
** swiper
:bind
("C-r" . swiper-isearch-backward)
:config
(setq swiper-action-recenter t)
(setq swiper-include-line-number-in-search t)
#+begin_src emacs-lisp
  (use-package swiper
    :ensure t
    :after (ivy)
    :bind (("C-s" . swiper)))
#+end_src
** rainbow-delimiters
彩虹括号
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :defer t
    :init (rainbow-delimiters-mode)
    :config
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+end_src
** company
:bind
(:map company-active-map
("C-n". company-select-next)
("C-p". company-select-previous)
("M-<". company-select-first)
("M->". company-select-last))
:config
(setq company-begin-commands '(self-insert-command))
(setq company-tooltip-limit 20)
(setq company-require-match nil)
(setq company-dabbrev-ignore-case t)
(setq company-dabbrev-downcase nil)
(setq company-dabbrev-other-buffers 'all)
(setq company-dabbrev-code-everywhere t)
(setq company-dabbrev-code-modes t)
(setq company-dabbrev-code-other-buffers 'all)
#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :defer t
    :init (add-hook 'after-init-hook 'global-company-mode)
    :config
    (setq company-minimum-prefix-length 1)
    (setq company-idle-delay 0.0)
    (setq company-tooltip-offset-display 'lines)
    (setq company-show-numbers t)
    (setq company-backends
          '((company-capf
             :with company-yasnippet :separate
             company-dabbrev-code company-gtags
             company-etags company-keywords)
             company-bbdb company-semantic company-cmake
             company-clang company-files
             company-oddmuse company-dabbrev)))
#+end_src
** lsp
:hook (c++-mode . lsp-deferred)
:hook (gdscript-mode . lsp-deferred)
:hook (rust-mode . lsp-deferred)
:hook (haskell-mode . lsp-deferred)
:hook (racket-mode . lsp-deferred)
:custom
(lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
(lsp-rust-analyzer-display-parameter-hints nil)
(lsp-rust-analyzer-display-reborrow-hints nil)
:config
(setq lsp-modeline-diagnostics-enable t) ;;Project errors on modeline
(setq lsp-headerline-breadcrumb-enable-symbol-numbers t)
(setq lsp-idle-delay 0.500)
(setq lsp-log-io nil) ;;if set to true can cause a performance hit
(setq lsp-enable-file-watchers nil)
:config now
(setq gc-cons-threshold 100000000)
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(setq lsp-modeline-code-actions-segments '(count icon name))
(setq lsp-signature-render-documentation nil) ;; 关闭在minibuffer的用eldoc显示的文档
(setq lsp-completion-provider :none) ;; lsp会自动设置company的backends，需要禁止此功能
#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure t
    :defer t
    :init
    (setq lsp-keymap-prefix "C-c l")
    :commands (lsp lsp-deferred)
    :hook (go-mode . lsp-deferred)
    :hook (c-mode . lsp-deferred)
    :custom
    (lsp-rust-analyzer-server-display-inlay-hints t)
    (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
    (lsp-rust-analyzer-display-chaining-hints t)
    (lsp-rust-analyzer-display-closure-return-type-hints t)
    :config
    (setq gc-cons-threshold 100000000)
    (setq read-process-output-max (* 1024 1024))
    (setq lsp-modeline-code-actions-segments '(count icon name))
    (setq lsp-signature-render-documentation nil)
    (setq lsp-completion-provider :none))
#+end_src
** lsp-ui
#+begin_src emacs-lisp
  (use-package lsp-ui
    :ensure t
    :after (lsp-mode)
    :custom
    (lsp-ui-peek-always-show t)
    (lsp-ui-sideline-show-hover t)
    (lsp-ui-doc-enable nil)
    :commands lsp-ui-mode)
#+end_src
** lsp-ivy
#+begin_src emacs-lisp
  (use-package lsp-ivy
    :ensure t
    :after (lsp-mode)
    :bind
    (:map zero-keymap
          ("v" . lsp-ivy-workspace-symbol)))
#+end_src
** flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :ensure t
    :defer t)
#+end_src
** yasnippet
:config
;; main mode
(yas-global-mode 1)
;; minor mode
(yas-reload-all)
(add-hook 'prog-mode-hook #'yas-minor-mode)

;; yasnippet
;; Trigger key
(define-key yas-minor-mode-map (kbd "<tab>") nil)
(define-key yas-minor-mode-map (kbd "TAB") nil)

;; Bind `SPC' to `yas-expand' when snippet expansion available (it
;; will still call `self-insert-command' otherwise).
(define-key yas-minor-mode-map (kbd "SPC") yas-maybe-expand)

;; Bind `C-c y' to `yas-expand' ONLY.
(define-key yas-minor-mode-map (kbd "C-<tab>") #'yas-expand)
(define-key yas-minor-mode-map (kbd "C-<tab>") #'company-other-backend)
#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :defer t
    :config
    (yas-global-mode)
    (define-key yas-minor-mode-map (kbd "<tab>") nil)
    (define-key yas-minor-mode-map (kbd "TAB") nil)
    (define-key yas-minor-mode-map (kbd "C-<tab>") #'yas-expand))
#+end_src
** yasnippet-snippets
#+begin_src emacs-lisp
  (use-package yasnippet-snippets
    :ensure t
    :after (yasnippet))
#+end_src
** golang
:config
(setq gofmt-command "goimports")
(add-hook 'before-save-hook 'gofmt-before-save)

;; go-mode default tab is 8, now set to 4
(add-hook 'go-mode-hook
    (lambda ()
    ;;(setq indent-tabs-mode 1)
    (setq tab-width 4)))

配置go一些功能
;; go run
(defun go-run()
    (interactive)
    (eshell)
    (insert "go run ."))
(define-key go-mode-map (kbd "C-c C-c") 'go-run)

;; Set up before-save hooks to format buffer and add/delete imports.
;; Make sure you don't have other gofmt/goimports hooks enabled.
#+begin_src emacs-lisp
  (defun lsp-go-install-save-hooks ()
    (setq tab-width 4)
    (add-hook 'before-save-hook #'lsp-format-buffer)
    (add-hook 'before-save-hook #'lsp-organize-imports))

  (use-package go-mode
    :ensure t
    :defer t
    :config
    (add-hook 'go-mode-hook #'lsp-go-install-save-hooks))
#+end_src
* no-install-packages
** exec-path-from-shell
macOS解决shell和emacs路径不统一
#+begin_src emacs-lisp--
  (when (memq window-system '(mac ns))
    (use-package exec-path-from-shell
      :ensure t
      :config
      (exec-path-from-shell-initialize)))
#+end_src
** eglot
(require 'eglot)
选择服务器
(add-to-list 'eglot-server-programs '(foo-mode . ("foo-language-server" "--args")))
(add-to-list 'eglot-server-programs '(c-mode . ("clangd")))
c语言启动eglot
(add-hook 'c-mode-hook 'eglot-ensure)
绑定快捷键
(define-key eglot-mode-map (kbd "C-c h") 'eglot-help-at-point)
(define-key eglot-mode-map (kbd "C-c C-f") 'eglot-format-buffer)
(define-key eglot-mode-map (kbd "<f6>") 'xref-find-definitions)
(define-key eglot-mode-map (kbd "C-c o") 'eglot-code-action-organize-imports)
#+begin_src emacs-lisp--
  (use-package eglot
    :ensure t
    :defer 1
    :config
    (add-to-list 'eglot-server-programs '(rust-mode . ("rust-analyzer")))
    (add-hook 'rust-mode-hook 'eglot-ensure))

  (add-hook 'go-mode-hook 'eglot-ensure)

  (defun eglot-format-buffer-on-save ()
    (add-hook 'before-save-hook #'eglot-format-buffer -10 t)
    (add-hook 'before-save-hook #'eglot-code-action-organize-imports -10 t))

  (add-hook 'go-mode-hook #'eglot-format-buffer-on-save)
#+end_src
