init.el

(use-package which-key
  :ensure t
  :defer t
  :init (which-key-mode))

(use-package ivy
  :ensure t
  :defer t
  :init (ivy-mode)
  :config
  (setq ivy-count-format "(%d/%d) "))

(use-package counsel
  :ensure t
  :after (ivy)
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-switch-buffer)
         ("C-x C-b" . ibuffer)
         ("C-x C-f" . counsel-find-file)))

(use-package swiper
  :ensure t
  :after (ivy)
  :bind (("C-s" . swiper)))

(use-package rainbow-delimiters
  :ensure t
  :defer t
  :init (rainbow-delimiters-mode)
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package company
  :ensure t
  :defer t
  :init (add-hook 'after-init-hook 'global-company-mode)
  :config
  (setq company-minimum-prefix-length 1)
  (setq company-idle-delay 0.0)
  (setq company-tooltip-offset-display 'lines)
  (setq company-show-numbers t)
  (setq company-backends
        '((company-capf
           :with company-yasnippet :separate
           company-dabbrev-code company-gtags
           company-etags company-keywords)
           company-bbdb company-semantic company-cmake
           company-clang company-files
           company-oddmuse company-dabbrev)))

(use-package lsp-mode
  :ensure t
  :defer t
  :init
  (setq lsp-keymap-prefix "C-c l")
  :commands (lsp lsp-deferred)
  :hook (go-mode . lsp-deferred)
  :hook (c-mode . lsp-deferred)
  :custom
  (lsp-rust-analyzer-server-display-inlay-hints t)
  (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
  (lsp-rust-analyzer-display-chaining-hints t)
  (lsp-rust-analyzer-display-closure-return-type-hints t)
  :config
  (setq gc-cons-threshold 100000000)
  (setq read-process-output-max (* 1024 1024))
  (setq lsp-modeline-code-actions-segments '(count icon name))
  (setq lsp-signature-render-documentation nil)
  (setq lsp-completion-provider :none))

(use-package lsp-ui
  :ensure t
  :after (lsp-mode)
  :custom
  (lsp-ui-peek-always-show t)
  (lsp-ui-sideline-show-hover t)
  (lsp-ui-doc-enable nil)
  :commands lsp-ui-mode)

(use-package lsp-ivy
  :ensure t
  :after (lsp-mode)
  :bind
  (:map zero-keymap
        ("v" . lsp-ivy-workspace-symbol)))

(use-package flycheck
  :ensure t
  :defer t)

(use-package yasnippet
  :ensure t
  :defer t
  :config
  (yas-global-mode)
  (define-key yas-minor-mode-map (kbd "<tab>") nil)
  (define-key yas-minor-mode-map (kbd "TAB") nil)
  (define-key yas-minor-mode-map (kbd "C-<tab>") #'yas-expand))

(use-package yasnippet-snippets
  :ensure t
  :after (yasnippet))

(defun lsp-go-install-save-hooks ()
  (setq tab-width 4)
  (add-hook 'before-save-hook #'lsp-format-buffer)
  (add-hook 'before-save-hook #'lsp-organize-imports))

(use-package go-mode
  :ensure t
  :defer t
  :config
  (add-hook 'go-mode-hook #'lsp-go-install-save-hooks))
