init.org
** treemacs
#+begin_src emacs-lisp--
  (use-package treemacs
    :ensure t
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-9") #'treemacs-select-window))
    :config
    (progn
      (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
            treemacs-deferred-git-apply-delay        0.5
            treemacs-directory-name-transformer      #'identity
            treemacs-display-in-side-window          t
            treemacs-eldoc-display                   'simple
            treemacs-file-event-delay                5000
            treemacs-file-extension-regex            treemacs-last-period-regex-value
            treemacs-file-follow-delay               0.2
            treemacs-file-name-transformer           #'identity
            treemacs-follow-after-init               t
            treemacs-expand-after-init               t
            treemacs-find-workspace-method           'find-for-file-or-pick-first
            treemacs-git-command-pipe                ""
            treemacs-goto-tag-strategy               'refetch-index
            treemacs-header-scroll-indicators        '(nil . "^^^^^^")
            treemacs-hide-dot-git-directory          t
            treemacs-indentation                     2
            treemacs-indentation-string              " "
            treemacs-is-never-other-window           nil
            treemacs-max-git-entries                 5000
            treemacs-missing-project-action          'ask
            treemacs-move-forward-on-expand          nil
            treemacs-no-png-images                   nil
            treemacs-no-delete-other-windows         t
            treemacs-project-follow-cleanup          nil
            treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
            treemacs-position                        'left
            treemacs-read-string-input               'from-child-frame
            treemacs-recenter-distance               0.1
            treemacs-recenter-after-file-follow      nil
            treemacs-recenter-after-tag-follow       nil
            treemacs-recenter-after-project-jump     'always
            treemacs-recenter-after-project-expand   'on-distance
            treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
            treemacs-show-cursor                     nil
            treemacs-show-hidden-files               t
            treemacs-silent-filewatch                nil
            treemacs-silent-refresh                  nil
            treemacs-sorting                         'alphabetic-asc
            treemacs-select-when-already-in-treemacs 'move-back
            treemacs-space-between-root-nodes        t
            treemacs-tag-follow-cleanup              t
            treemacs-tag-follow-delay                1.5
            treemacs-text-scale                      nil
            treemacs-user-mode-line-format           nil
            treemacs-user-header-line-format         nil
            treemacs-wide-toggle-width               70
            treemacs-width                           35
            treemacs-width-increment                 1
            treemacs-width-is-initially-locked       t
            treemacs-workspace-switch-cleanup        nil

            treemacs-git-mode                        nil
            )

      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)
      ;;(when treemacs-python-executable
      ;;  (treemacs-git-commit-diff-mode t))

      ;;(pcase (cons (not (null (executable-find "git")))
      ;;             (not (null treemacs-python-executable)))
      ;;  (`(t . t)
      ;;   (treemacs-git-mode 'deferred))
      ;;  (`(t . _)
      ;;   (treemacs-git-mode 'simple)))

      (treemacs-hide-gitignored-files-mode nil))
    :bind
    (:map global-map
          ("M-9"       . treemacs-select-window)
          ;;("C-x t 1"   . treemacs-delete-other-windows)
          ;;("C-x t t"   . treemacs)
          ;;("C-x t d"   . treemacs-select-directory)
          ;;("C-x t B"   . treemacs-bookmark)
          ;;("C-x t C-t" . treemacs-find-file)
          ;;("C-x t M-t" . treemacs-find-tag)
          )
    )
#+end_src
** magit
#+begin_src emacs-lisp--
  (use-package magit
    :ensure t
    :defer t)
#+end_src
** rust
#+begin_src emacs-lisp--
  (use-package rust-mode
    :ensure t
    :defer t
    :config
    (setq rust-format-on-save t)
    (define-key rust-mode-map (kbd "C-c C-c") 'rust-run))
#+end_src
** flycheck-rust
#+begin_src emacs-lisp--
  (use-package flycheck-rust
    :ensure t
    :defer 1)
#+end_src
** haskell
#+begin_src emacs-lisp--
  (use-package haskell-mode
    :ensure t
    :defer 1)
#+end_src
** lsp-haskell
#+begin_src emacs-lisp--
  (use-package lsp-haskell
    :ensure t
    :defer 1)

  (defun lsp-haskell-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer))
  (add-hook 'haskell-mode-hook #'lsp-haskell-install-save-hooks)

  (add-hook 'haskell-interactive-mode-hook
            (lambda () (linum-mode -1)))
#+end_src
** common-lisp-slime
#+begin_src emacs-lisp--
  (use-package slime
    :config (setq inferior-lisp-program "/usr/bin/sbcl"))
#+end_src
** racket
#+begin_src emacs-lisp--
  (use-package racket-mode
    :ensure t
    :disabled
    :defer 1)
#+end_src
** godot
(defun lsp--gdscript-ignore-errors (original-function &rest args)
  "Ignore the error message resulting from Godot not replying to the `JSONRPC' request."
  (if (string-equal major-mode "gdscript-mode")
  (let ((json-data (nth 0 args)))
        (if (and (string= (gethash "jsonrpc" json-data "") "2.0")
                 (not (gethash "id" json-data nil))
                 (not (gethash "method" json-data nil)))
            nil ; (message "Method not found")
          (apply original-function args)))
    (apply original-function args)))
  ;; Runs the function `lsp--gdscript-ignore-errors` around `lsp--get-message-type` to suppress unknown notification errors.
  (advice-add #'lsp--get-message-type :around #'lsp--gdscript-ignore-errors)
#+begin_src emacs-lisp--
  (use-package gdscript-mode
    :ensure t
    :config
    ;;(setq gdscript-gdformat-save-and-format t)
    ;;(setq gdscript-godot-executable "D:/ProgramFilese/godot.exe")
    (setq gdscript-use-tab-indents t)
    (setq gdscript-indent-offset 4))
#+end_src
* built-in-packages
** 代码折行
#+begin_src emacs-lisp
  (define-key zero-keymap (kbd "M-v") 'hs-toggle-hiding)
  (add-hook 'prog-mode-hook #'hs-minor-mode)
#+end_src
** c-mode-config
*** clang-format
在 ~ 家目录创建文件 .clang-format 以下是文件的内容：

---
#BasedOnStyle: llvm
BasedOnStyle: google

#AllowShortBlocksOnASingleLine: Empty
#AllowAllParametersOfDeclarationOnNextLine: true
#AllowShortIfStatementsOnASingleLine: true
AlignArrayOfStructures: Left
AllowShortFunctionsOnASingleLine: Empty

#tab键盘的宽度
#TabWidth: 4

#缩进宽度
IndentWidth: 4

#指针和引用的对齐: Left, Right, Middle
#PointerAlignment:   Middle

#UseTab: Never
*** 配置
#+begin_src emacs-lisp
  (defun lsp-c-mode-hooks ()
    (setq c-basic-offset 4)
    (c-toggle-comment-style -1)
    (add-hook 'before-save-hook #'lsp-format-buffer))
  (add-hook 'c-mode-hook #'lsp-c-mode-hooks)
#+end_src
** 如果是windows就把默认minibuffer打开路径设置为下面的
#+begin_src emacs-lisp
  (when *is-windows*
    (setq default-directory "e:/"))
#+end_src
** eshell no need company
#+begin_src emacs-lisp
  (add-hook 'eshell-mode-hook
            (lambda ()
              (company-mode -1)))
#+end_src
** org-mode config
文字上的下划线与文字的间距加大
(setq x-underline-at-descent-line t)

把org-mode的时间显示改成英文
(setq system-time-locale "C")
(add-hook 'org-mode-hook
(lambda ()
(set (make-local-variable 'system-time-locale) "C")))

org-mode 自动折行功能
(setq truncate-lines nil)
#+begin_src emacs-lisp
  (setq org-ellipsis " ◄")
  (add-hook 'org-mode-hook
            (lambda ()
              (org-indent-mode)
              (linum-mode -1)))
#+end_src
** dired-mode config
(put 'dired-find-alternate-file 'disabled nil)

(with-eval-after-load 'dired
    (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file))

(setq dired-recursive-deletes 'always)
(setq dired-recursive-copies 'always)

(add-hook 'dired-mode-hook
    (lambda ()
    (define-key dired-mode-map (kbd "^")
    (lambda () (interactive) (find-alternate-file "..")))))
* custom-shortcut-keybindings
** 说明
三种配置步骤
第一种:通用隐含与leader按键绑定配置
(define-prefix-command 'my-map)
(global-set-key (kbd "M-n") 'my-map)
(global-set-key (kbd "M-n b") 'find-file)

第二种:明确与leader按键绑定配置
(define-prefix-command 'my-map)
(global-set-key (kbd "M-n") 'my-map)
(define-key my-map (kbd "b") 'find-file)

第三种:多重leader按键嵌套配置
(define-prefix-command 'my-first-map)
(define-prefix-command 'my-second-map)
(define-prefix-command 'my-thried-map)

(global-set-key (kbd "M-n") 'my-first-map)
(define-key my-first-map (kbd "M-p") 'my-second-map)
(define-key my-first-map (kbd "M-k") 'my-thried-map)

(define-key my-thried-map (kbd "!") 'save-file)
(define-key my-thried-map (kbd "k") 'write-file)
(define-key my-thried-map (kbd "kj")
   (lambda ()
     (interactive)
     (save-buffer)
     (kill-emacs)))
** 开始定义 zero-keymap
内容已经放到 init 区域
** 开始绑定 zero-keymap
在两个之间只留下一个空格
清除每一行末尾没用的空白
输入 eshell 命令
open init file
手动切换不同输入法
counsel-recentf
重复上一个命令
copy current line to below
move word line
programming format buffer
分屏窗口操作
#+begin_src emacs-lisp
  (define-key zero-keymap (kbd "n") 'just-one-space)
  (define-key zero-keymap (kbd "m") 'whitespace-cleanup)
  (define-key zero-keymap (kbd "e") 'eshell)
  (define-key zero-keymap (kbd "<f2>") 'zero-open-init-file)
  (define-key zero-keymap (kbd "x") 'zero-cycle-font-method)
  (define-key zero-keymap (kbd "r") 'counsel-recentf)
  (define-key zero-keymap (kbd "M-r") 'repeat)
  (define-key zero-keymap (kbd "M-d") 'zero-duplicate-line)

  (define-key zero-keymap (kbd "M-p") 'zero-move-line-up)
  (define-key zero-keymap (kbd "M-n") 'zero-move-line-down)
  (define-key zero-keymap (kbd "M-b") 'zero-move-word-left)
  (define-key zero-keymap (kbd "M-f") 'zero-move-word-right)

  (define-key zero-keymap (kbd "f") 'lsp-format-buffer)

  (define-key zero-keymap (kbd "wp") 'windmove-swap-states-up)
  (define-key zero-keymap (kbd "wn") 'windmove-swap-states-down)
  (define-key zero-keymap (kbd "wb") 'windmove-swap-states-left)
  (define-key zero-keymap (kbd "wf") 'windmove-swap-states-right)

  (define-key zero-keymap (kbd "w[") 'shrink-window-horizontally)
  (define-key zero-keymap (kbd "w]") 'enlarge-window-horizontally)
  (define-key zero-keymap (kbd "w;") 'shrink-window)
  (define-key zero-keymap (kbd "w'") 'enlarge-window)
  (define-key zero-keymap (kbd "w/") 'balance-windows)
#+end_src
** 开始绑定 全局功能
;; 替换mac下 alt 和 meta 建
(when *is-mac*
    (setq mac-command-modifier 'meta)
    (setq mac-option-modifier 'none))

;; copy line or region
(global-set-key (kbd "M-w") 'zero-copy-line-or-region)

;; open down new line  (kbd "M-RET")
(global-set-key (kbd "M-RET") (lambda () (interactive)
    (move-end-of-line nil) (newline)))

;; 手动切换不同输入法
(global-set-key (kbd "C-c x") 'zero-cycle-font-method)

;; 在Emacs中切换中文和日文
(global-set-key (kbd "M-\\") 'zero-cycle-input-method)
#+begin_src emacs-lisp
  (global-set-key (kbd "M-o") 'other-window)
  (global-set-key (kbd "M-0") 'delete-window)
  (global-set-key (kbd "M-1") 'delete-other-windows)
  (global-set-key (kbd "M-2") 'split-window-below)
  (global-set-key (kbd "M-3") 'split-window-right)

  (global-set-key (kbd "M-[") 'previous-buffer)
  (global-set-key (kbd "M-]") 'next-buffer)

  (global-set-key (kbd "C-M-n") 'scroll-up-line)
  (global-set-key (kbd "C-M-p") 'scroll-down-line)
#+end_src
* init-footer
** 配置
#+begin_src emacs-lisp

  ;; Local Variables:
  ;; no-byte-compile: t
  ;; fill-column: 95
  ;; End:

  ;;; init.el ends here
#+end_src
