init.el

(define-key zero-keymap (kbd "M-v") 'hs-toggle-hiding)
(add-hook 'prog-mode-hook #'hs-minor-mode)

(defun lsp-c-mode-hooks ()
  (setq c-basic-offset 4)
  (c-toggle-comment-style -1)
  (add-hook 'before-save-hook #'lsp-format-buffer))
(add-hook 'c-mode-hook #'lsp-c-mode-hooks)

(when *is-windows*
  (setq default-directory "e:/"))

(add-hook 'eshell-mode-hook
          (lambda ()
            (company-mode -1)))

(setq org-ellipsis " ◄")
(add-hook 'org-mode-hook
          (lambda ()
            (org-indent-mode)
            (linum-mode -1)))

(define-key zero-keymap (kbd "n") 'just-one-space)
(define-key zero-keymap (kbd "m") 'whitespace-cleanup)
(define-key zero-keymap (kbd "e") 'eshell)
(define-key zero-keymap (kbd "<f2>") 'zero-open-init-file)
(define-key zero-keymap (kbd "x") 'zero-cycle-font-method)
(define-key zero-keymap (kbd "r") 'counsel-recentf)
(define-key zero-keymap (kbd "M-r") 'repeat)
(define-key zero-keymap (kbd "M-d") 'zero-duplicate-line)

(define-key zero-keymap (kbd "M-p") 'zero-move-line-up)
(define-key zero-keymap (kbd "M-n") 'zero-move-line-down)
(define-key zero-keymap (kbd "M-b") 'zero-move-word-left)
(define-key zero-keymap (kbd "M-f") 'zero-move-word-right)

(define-key zero-keymap (kbd "f") 'lsp-format-buffer)

(define-key zero-keymap (kbd "wp") 'windmove-swap-states-up)
(define-key zero-keymap (kbd "wn") 'windmove-swap-states-down)
(define-key zero-keymap (kbd "wb") 'windmove-swap-states-left)
(define-key zero-keymap (kbd "wf") 'windmove-swap-states-right)

(define-key zero-keymap (kbd "w[") 'shrink-window-horizontally)
(define-key zero-keymap (kbd "w]") 'enlarge-window-horizontally)
(define-key zero-keymap (kbd "w;") 'shrink-window)
(define-key zero-keymap (kbd "w'") 'enlarge-window)
(define-key zero-keymap (kbd "w/") 'balance-windows)

(global-set-key (kbd "M-o") 'other-window)
(global-set-key (kbd "M-0") 'delete-window)
(global-set-key (kbd "M-1") 'delete-other-windows)
(global-set-key (kbd "M-2") 'split-window-below)
(global-set-key (kbd "M-3") 'split-window-right)

(global-set-key (kbd "M-[") 'previous-buffer)
(global-set-key (kbd "M-]") 'next-buffer)

(global-set-key (kbd "C-M-n") 'scroll-up-line)
(global-set-key (kbd "C-M-p") 'scroll-down-line)

;; Local Variables:
;; no-byte-compile: t
;; fill-column: 95
;; End:

;;; init.el ends here
